// Следующая функция возвращает true, если параметр age больше 18.
// В ином случае она задаёт вопрос confirm и возвращает его результат.
// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm('Родители разрешили?');
//   }
// }
// Перепишите функцию, чтобы она делала то же самое, но без if, в одну строку.
// Сделайте два варианта функции checkAge:
// Используя оператор ?
// Используя оператор ||

function checkAge(age) {

    return (age>18) ? true : 'Родители разрешили?';
}

function checkAge2(age) {

    return (age>18) || 'Родители разрешили?';
}

console.log(checkAge(19));
console.log(checkAge2(17));

// Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b.
// Пример вызовов:
// min(2, 5) == 2
// min(3, -1) == -1
// min(1, 1) == 1

function min (a,b){

    return (a<b) ? a : b;
}

console.log(min(3,5))

// Напишите функцию pow(x,n), которая возводит x в степень n и возвращает результат.
// pow(3, 2) = 3 * 3 = 9
// pow(3, 3) = 3 * 3 * 3 = 27
// pow(1, 100) = 1 * 1 * ...* 1 = 1
// Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).
// P.S. В этой задаче функция обязана поддерживать только натуральные значения n,
//  т.е. целые от 1 и выше.

function pow(a,b){

    let res = 1;

    for(let i = 0; i < b ; i++ ){
        res*=a
    }

    return res;
}

console.log(pow(4,3))
